{"tags":[{"name":"生活","permalink":"https://catlittlechen.com/tags/生活/","url":"/async/tags/生活.json","count":6}],"categories":[{"name":"活着","permalink":"https://catlittlechen.com/categories/活着/","url":"/async/categories/活着.json","count":6}],"url":"/async/posts/2018/02/17/向2017致敬.json","date":1518799132000,"path":{"year":2018,"month":2,"day":17,"name":"向2017致敬"},"title":"向2017致敬","permalink":"https://catlittlechen.com/2018/02/17/向2017致敬/","content":"<h2 id=\"大概\"><a href=\"#大概\" class=\"headerlink\" title=\"大概\"></a>大概</h2><p>大年初一结束了。每年过年的放假，除了陪陪家人，次要的事情就是反思过去。</p>\n<p>2017年，这个鸡年，打个分的话，只有59分，差一分及格。</p>\n<p>也许，这是涅槃重生吧。为了不变成自己讨厌的人。为了听从自己心中最直白的话。</p>\n<h2 id=\"家庭\"><a href=\"#家庭\" class=\"headerlink\" title=\"家庭\"></a>家庭</h2><p>对不起，爷爷。在日本跑了许久买回来的长寿符，我没能交到您的手中。听姐姐说，您走的时候，十分安详。从监控中，我看到您日渐消瘦，妈妈曾经暗示过我，但是我就是不相信。对不起，虽然靠着美林和消炎药，我才送了您人生的最后一程。而后的一个月，反复的发烧和咳嗽，一次又一次得提醒着我，这段悲伤的记忆。<br>对不起，老猫。我还记得第一次你来我家的时候，是10年前了。那时候你很害怕，一下子钻到沙发底下。从此，不愿意再走出这个家一步。妹妹说，你很懂事，知道也许爷爷去世后，我们就会去新家，而你不想去，就先离开了。爸爸并没有告诉我们出外的孩子，你什么时候离开的，依照习俗被放在了哪条河流里。回家后，没听到你的叫声，都不太习惯了。<br>对不起，妈妈。也许从小到大，我从来没让您失望过，也基本没有反驳过您。新家入宅后，您向我提出希望可以娶嘻嘻回家。而我拒绝了。也许不愿意我的人生再这样子按照世俗的轨迹去走，也许只是叛逆，也许为了自由人生，也许为了逃避责任吧。后来爸爸说您病了一场，十分惭愧。<br>对不起，爸爸。如果当初我做了最好的选择，那至少我现在有能力可以买下您现在的店铺。让您可以有个地方安心工作，即使喝喝茶也好。假以时日，我一定会买回来的。<br>对不起，妹妹。其实当初你接触微商的时候，我就想过，你会不会用到他们假的产品。但是我不知道后果会如此的严重。我后悔了。如果当初我阻止你，也不至于到了如今的地步。让你忍受了痛苦长达两年之久。你现在的痛苦，我有着大部分的责任。还好最近看到你在恢复，一切都会好的。<br>对不起，嘻嘻。我将毕业两年来的所有收入给了家里买房的时候，我很怕你离开我。可是你不但没有离开，还害怕我工作太累，不希望我去加班的公司。你给了我时间思考我的人生。可是我还是没能想到如何创造价值。你说我坚守的底线才错过那么多机会，但是也没强迫我做任何事。谢谢你。</p>\n<h2 id=\"工作\"><a href=\"#工作\" class=\"headerlink\" title=\"工作\"></a>工作</h2><p>我从偶玩部门，去到国内广告，再借去海外部门，辗转最后到基础部门。这几年里面，基本上跑遍了整个公司所有部门。其实，公司性格测试的结果，我还是蛮认同的。我属于学者型的人，15蓝的典型理科生，喜欢学习新的事物，不喜欢重复劳动，洁癖一样的业务编码习惯。<br>小公司最好的地方，莫过于可以挑战很多新的技术，但是坏处也是需要短时间内拿出成果，不然很容易被否定。不过这也就是时代的需求。对于新的技术的从学习到应有，是需要快速交付的。只有在实践中，再慢慢探索，踩坑，填坑，最后从自己原有的架构里面，转化出新的架构。<br>不过，小公司不能好好地安心研究技术。因为大部分的小公司都是为了盈利而努力着。而技术大部分程度上都无法左右业务，所以结果上，福利会比大公司差很多。而以利润为基础的制度，感觉高层的错误决策，最终还是得下层的员工来承担。吧啦巴拉巴拉吧喇叭。<br>做了老板的同学和我说，工资和年终多少，大部分程度上并不是很所谓。但是一旦承诺了，而最终无论已任何理由少给或者不给，人心一下子就散了。不过为了所谓的什么什么，感觉公司的每个人都过得不容易。  </p>\n<h2 id=\"自己\"><a href=\"#自己\" class=\"headerlink\" title=\"自己\"></a>自己</h2><p>2017年，有着很多误解、离别和伤痛。从挣扎，痛苦，沉默中慢慢重新看待这个世界。和大量的人接触，交换了人生的各种。2018开始了。<br>我明白这个世界不是付出了就可以有收获，但是只有付出，才能知道是否有收获。谢谢一直支持了这么年多的你们。对不起各位，我回来了。<br>在历史的长河里，自己像一个孤独无助的求学者。在喧嚣的路途中，静静地翻看着书籍。略去前人无数的重复的结论，探寻着世界自己无知的认知。不知道还可以好好看多久的书，多一页是一页吧。在阳光透过窗户时醒来，感受着温暖和生机，牢笼囚禁不住追求自由完美的心，愿拥有勇气面对多变的世界，愿拥有耐心面对不变的世界，愿拥有智慧去分辨两者，愿世界变得更加美好！！！</p>\n"}